//1. შექმენით სამი Int ტიპის ცვლადი, მიანიჭეთ მათ მნიშვნელობა და დაბეჭდეთ მათი ნამრავლი.
var firstNumber = 2
var secondNumber = 3
var thirdNumber = 4
print(firstNumber*secondNumber*thirdNumber)

//2. შექმენით int ტიპის ცვლადი, მიანიჭეთ მას მნიშვნელობა და შეამოწმეთ ეს რიცხვი ლუწია თუ კენტი ტერნარი ოპერატორით.
var num :Int
num = 8
var result = num % 2 == 0 ? "ლუწია" : "კენტია"
print (result)

//3. შექმენით optional String-ის ტიპის და მიანიჭეთ თქვენი სახელის მნიშვნელობა. If let-ის მეშვეობით გაუკეთეთ unwrap და მნიშვნელობა დაპრინტეთ
var name :String?
name = "Begi"
if let name {
    print(name)
}
//4. შექმენით ცვლადი სახელად isRaining ბულეანის ტიპის და მიანიჭეთ თქვენთვის სასურველი მნიშვნელობა. If-else-ის მეშვეობით შეამოწმეთ თუ მნიშვნელობა მიიღებს true მნიშვნელობას დაბეჭდეთ “ქოლგის წაღება არ დამავიწყდეს”, სხვა შემთხვევაში “დღეს ქოლგა არ დამჭირდება”.
var isRaining = true
if isRaining {
    print("ქოლგის წაღება არ დამავიწყდეს")
} else {
    print("დღეს ქოლგა არ დამჭირდება")
}
// 21-ე ხაზზე შემეძლო isRaining == true დამეწერა და იგივეს იზავდა თუმცა ექსპრეშენში ცვლადს როცა ვაძლევთ თრუ ზე ამოწმებს ისედაც

//5. შექმენით ორი int ტიპის ცვლადი a & b და მიანიჭეთ სასურველი რიცხვები. If-else-ით შეამოწმეთ თუ a მეტია b-ზე დაბეჭდეთ “a მეტია”,  სხვა შემთხვევაში “b მეტია”
var a = 4
var b = 4
if a > b {
    print("a > b")
} else {
    print("b > a")
    if a == b {
        print("a = b")
    }
}
// 35 ხაზზე ტოლობის პირობა გადააწერს რეალურად b > a ს მნიშვნელობას a = b ს როცა ტოლი იქნება ორი ცვლადი (სპეციალურად გავაკეთე). შინაარსობრივად სწორად იმუშავებს თუმცა პრაქტიკულად ჯობია if ში გატანა. (შემდეგ დავალებებში გავაკეთებ)

//6. შექმენით მუდმივა Character ტიპის და მიანიჭეთ თქვენი სახელის პირველი ასოს მნიშვნელობა.
var char :Character
char = "b"
//7. მოცემულია ორნიშნა რიცხვი, გაიგეთ არის თუ არა ერთიდაიმავე ციფრისგან შემდგარი
var number = 33
if number % 10 == number / 10 {
    print("ორნიშნაა")
} else {
    print("არ არის ორნიშნა")
}

//8. აიღეთ ცვლადი numberOfMonths მიანიჭეთ მნიშვნელობა და იმის მიხედვით თუ მერამდენე თვეა დაბეჭდეთ ის (გაზაფხული, ზაფხული, შემოდგომა, ზამთარი) შესაბამისად.
var numberOfMonths = 11
if numberOfMonths == 3 || numberOfMonths == 4 || numberOfMonths == 5 {
    print("გაზაფხული")
} else if numberOfMonths == 6 || numberOfMonths == 7 || numberOfMonths == 8 {
    print("ზაფხული")
} else if numberOfMonths == 9 || numberOfMonths == 10 || numberOfMonths == 11 {
    print("შემოდგომა")
} else if numberOfMonths == 12 || numberOfMonths == 1 || numberOfMonths == 2 {
    print("ზამთარი")
} else {
    print("მაგდენი თვე არ არის წელიწადში ჩემო ძმაო")
}

//9. შექმენით მთელი რიცხვის მქონე ცვლადი. თუ ეს ცვლადი იყოფა 3-ზე, დაბეჭდეთ “იყოფა 3-ზე”, თუ ეს ცვლადი იყოფა 4-ზე დაბეჭდეთ “იყოფა 4-ზე”, თუ იყოფა ორივეზე დაბეჭდეთ “იყოფა 3-ზე და 4-ზე”
var newNumber = 9
if newNumber % 3 == 0 && newNumber % 4 == 0 {
    print("ორივეზე იყოფა")
} else if newNumber % 3 == 0 && newNumber % 4 != 0 {
    print("იყოფა 3ზე, 4ზე არა")
} else if newNumber % 3 != 0 && newNumber % 4 == 0 {
    print("იყოფა 4ზე, 3ზე არა")
} else {
    print("არცერთზე არ იყოფა")
}

//10. შექმენით ორი რიცხვითი ცვლადი num1, num2 და რაიმე String ტიპის ცვლადი რომელსაც ტერნარული ოპერატორის საშუალებით მიანიჭებთ “თანაბრად დაშორებულია ნულიდან” / “არ არის თანაბრად დაშორებული ნულიდან” შესაბამის მნიშვნელობას რომელსაც აკმაყოფილებს მოცემული ორი ცვლადი
var num1 = -10
var num2 = 11
var resultFromNums = -num1 - num2 == 0 || -num2 - num1 == 0 || num1 == num2 ? "თანაბრად დაშორებულია ნულიდან" : "არ არის თანაბრად დაშორებული ნულიდან"
print (resultFromNums)
